{
    "Home": {
        "Home_Header1": "Hello/你好/こんにちは!",
        "Home_Header2": "My name is",
        "Home_Header3": "Dorian",
        "Home_Education1": "M.S. Biomedical Engineering, New York University",
        "Home_Education2": "B.S. Biology, Psychology, University of Oregon",
        "Home_Button": "CONTACT ME"
    },

    "About" : {
        "About_Me": "About Me",
        "About_Me_Header": "'An image is nothing more than a two dimensional signal that can defined by a mathematical function f(x,y).'",
        "About_Me_Body1": "My interest in signal processing began during my undergraduate research experience, where I focused on quantifying olfactory search behavior in mice. It was during this period where I developed my passion for programming and realized that so much useful information can encoded in a seemingly 'simple' signal.",
        "About_Me_Body2": "Upon beginning my Master's degree in biomedical engineering at New York University, I have pursued coursework to further my knowledge of the Fourier transform and methods to apply it to real-life scenarios. My interest thus far is in signal processing and embedded systems. To showcase this, I have developed a realtime ECG monitoring device with a group for a course project, where I acted as the software lead for signal acquisition and filtering.",
        "About_Me_Close":"If I could describe myself in one word, it would be: 'naturally curious and always looking for ways improve myself and help those around me' !! If you are interested in learning more specifics about my background, please refer to my CV~"
    },

    "Projects": {
        "ECG": {
            "id": {"index": 0},
            "name": "Realtime ECG Monitoring",
            "link": "https://github.com/civond/ecgacquisition",
            "content": "Using Arduino, Python, and open-source hardware components, me and my team designed a realtime ECG monitoring device. My role was the software lead for signal filtering and acquisiton. During signal acquisiton, the ECG data was plotted in real time using a list and then written to a .csv file. Next, the signal was denoised using a bandpass filter with cutoff frequencies of 22.4 Hz (LPF), and 3.18 Hz (HPF). ",
            "image": "../images/ECG.png"
        },
        "Freq_Resp": {
            "id": {"index": 1},
            "name": "Audio Noise Reduction",
            "link": "https://github.com/civond/tonalnoise",
            "content": "Using MATLAB, I evaluated and compared a low-pass Butterworth (filter #2) with a N-point moving average (filter #1) to remove high frequency noise from an audio signal. Additionally, the audio signal contains a 400 Hz tonal noise, which was attenuated by convolving the chosen LPF with a 4th order IIR notch filter. Just by comparing the frequency responses, you can see that the attenuation of the Butterworth filter is much better. This results in a much cleaner audio signal output.",
            "image": "../images/FreqResp.jpg"
            },
        "FMON_Deep": {
            "id": {"index": 2},
            "name": "FMON DeepLabCut",
            "link": "https://github.com/civond/FMOS-DeepLabCut-Pipeline'",
            "content": "Using Dropbox's and Google Drive's API in Python, this script streamlines the tedious process of managing files across shared workspaces for use in DeepLabCut's Google Colabs notebook.",
            "image": "../images/trajectory.png"
        },
        "FMON_Vis": {
            "id": {"index": 3},
            "name": "FMON Visualization",
            "link": "https://github.com/civond/FMON_DataManagement",
            "content": "To visualize historical mouse performance data, this Python script parses through raw data files on FMOS computer and compiles relevant information into one centralized spreadsheet. Then, this spreadsheet is used to generate vaious graphs and daily performance statistics using matplotlibs and pandas.",
            "image": "../images/2152_100Performance.png"
        },
        "Earthquake": {   
            "id": {"index": 4},
            "name": "Mapping Earthquakes",
            "link": "https://github.com/civond/Mapping_Earthquakes",
            "content": "In this project, I used JavaScript with Mapbox to create a map overlay of earthquakes that occured in the past 7 days. Includes interchangable map backgrounds, togglable earthquake magnitudes, and display popups.",
            "image": "../images/Map.png"
        }
    },

    "Links" : {
        "GitHub" : "https://github.com/civond?tab=repositories",
        "CV": "https://drive.google.com/file/d/1mqwkoOvQ6eC8R7LkVqhlLjTQob47-IhP/view?usp=sharing",
        "LinkedIn": "https://www.linkedin.com/in/d-yeh/",
        "Lab": "https://longlab.med.nyu.edu/",
        "color": "#4d4d4e"
    }
}